In [1]:
import requests
import json
import prettytable
import pandas as pd

### Read-in and format Civilian Population Data

In [2]:
civilian_pop=pd.read_csv('../data/bls/civilian_noninstitutional_population_LNU00000000.csv')

In [3]:
civilian_pop.head()

,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,1948,102603,102698,102771,102831,102923,102992,103216,103240,103291,103361,103424,103468
1,1949,103529,103559,103665,103739,103845,103930,104042,104121,104219,104338,104421,104524
2,1950,104619,104737,104844,104943,105014,105104,105194,105282,105269,105096,104979,104872
3,1951,104844,104604,104629,104541,104491,104488,104504,104536,104588,104690,104740,104810
4,1952,104862,104868,104860,104906,104996,105118,105246,105346,105436,105591,105706,105812

In [4]:
civilian_pop.columns

Index(['Year', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep',
       'Oct', 'Nov', 'Dec'],
      dtype='object')

In [5]:
civilian_pop.isnull().sum()

Year    0
Jan     0
Feb     0
Mar     0
Apr     0
May     0
Jun     0
Jul     0
Aug     0
Sep     0
Oct     0
Nov     0
Dec     0
dtype: int64

In [6]:
civilian_pop_tall = civilian_pop.melt(id_vars = ['Year'], value_vars=['Jan', 'Feb', 'Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'], var_name=['month_name'], value_name='pop')

In [7]:
civilian_pop_tall=civilian_pop_tall.rename(columns={'Year':'year',  'pop':'civilian_pop'})

In [8]:
civilian_pop_tall.head()

   year month_name civilian_pop
0  1948        Jan       102603
1  1949        Jan       103529
2  1950        Jan       104619
3  1951        Jan       104844
4  1952        Jan       104862

In [9]:
def month_number(counter):
    if (counter['month_name'] == 'Jan'):
        return 1
    elif (counter['month_name'] == 'Feb'):
        return 2
    elif (counter['month_name'] == 'Mar'):
        return 3
    elif (counter['month_name'] == 'Apr'):
        return 4
    elif (counter['month_name'] == 'May'):
        return 5
    elif (counter['month_name'] == 'Jun'):
        return 6
    elif (counter['month_name'] == 'Jul'):
        return 7
    elif (counter['month_name'] == 'Aug'):
        return 8
    elif (counter['month_name'] == 'Sep'):
        return 9
    elif (counter['month_name'] == 'Oct'):
        return 10
    elif (counter['month_name'] == 'Nov'):
        return 11
    elif (counter['month_name'] == 'Dec'):
        return 12
    else:
        return 'adjust'
civilian_pop_tall["month"] = civilian_pop_tall.apply(month_number, axis=1)

In [10]:
civilian_pop_tall.head()

   year month_name civilian_pop  month
0  1948        Jan       102603      1
1  1949        Jan       103529      1
2  1950        Jan       104619      1
3  1951        Jan       104844      1
4  1952        Jan       104862      1

In [11]:
civilian_pop_tall['date'] = pd.to_datetime(civilian_pop_tall[['year', 'month']].assign(day=1))

In [12]:
civilian_pop_tall=civilian_pop_tall[['year','month_name','month','date','civilian_pop']]

In [13]:
civilian_pop_tall = civilian_pop_tall.sort_values('date')

In [14]:
civilian_pop_tall.head()

     year month_name  month       date civilian_pop
0    1948        Jan      1 1948-01-01       102603
74   1948        Feb      2 1948-02-01       102698
148  1948        Mar      3 1948-03-01       102771
222  1948        Apr      4 1948-04-01       102831
296  1948        May      5 1948-05-01       102923

### Read-in and format Employment Level

In [15]:
employment_level=pd.read_csv('../data/bls/employment_level_LNU02000000.csv')

In [16]:
employment_level.head()

,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,1948,56339,56440,56601,57471,57763,59724,59955,59677,59337,59290,58991,58554
1,1949,56486,56320,56809,56929,57669,58231,58171,58504,58324,58050,58616,57712
2,1950,56189,56197,56733,57812,58719,59997,59839,60948,60245,60708,60313,59352
3,1951,58166,58102,59366,59206,60219,60373,60968,61128,60408,60906,60464,60252
4,1952,58884,58834,58912,59232,60250,60988,60775,60872,61162,60992,61394,60748

In [17]:
employment_level.columns

Index(['Year', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep',
       'Oct', 'Nov', 'Dec'],
      dtype='object')

In [18]:
employment_level.isnull().sum()

Year    0
Jan     0
Feb     0
Mar     0
Apr     0
May     0
Jun     0
Jul     0
Aug     0
Sep     0
Oct     0
Nov     0
Dec     0
dtype: int64

In [19]:
employment_level_tall = employment_level.melt(id_vars = ['Year'], value_vars=['Jan', 'Feb', 'Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'], var_name=['month_name'], value_name='employment_level')

In [20]:
employment_level_tall=employment_level_tall.rename(columns={'Year':'year'})

In [21]:
employment_level_tall.head()

   year month_name employment_level
0  1948        Jan            56339
1  1949        Jan            56486
2  1950        Jan            56189
3  1951        Jan            58166
4  1952        Jan            58884

In [22]:
def month_number(counter):
    if (counter['month_name'] == 'Jan'):
        return 1
    elif (counter['month_name'] == 'Feb'):
        return 2
    elif (counter['month_name'] == 'Mar'):
        return 3
    elif (counter['month_name'] == 'Apr'):
        return 4
    elif (counter['month_name'] == 'May'):
        return 5
    elif (counter['month_name'] == 'Jun'):
        return 6
    elif (counter['month_name'] == 'Jul'):
        return 7
    elif (counter['month_name'] == 'Aug'):
        return 8
    elif (counter['month_name'] == 'Sep'):
        return 9
    elif (counter['month_name'] == 'Oct'):
        return 10
    elif (counter['month_name'] == 'Nov'):
        return 11
    elif (counter['month_name'] == 'Dec'):
        return 12
    else:
        return 'adjust'
employment_level_tall["month"] = employment_level_tall.apply(month_number, axis=1)

In [23]:
employment_level_tall.head()

   year month_name employment_level  month
0  1948        Jan            56339      1
1  1949        Jan            56486      1
2  1950        Jan            56189      1
3  1951        Jan            58166      1
4  1952        Jan            58884      1

In [24]:
employment_level_tall['date'] = pd.to_datetime(employment_level_tall[['year', 'month']].assign(day=1))

In [25]:
employment_level_tall = employment_level_tall.sort_values('date')

In [26]:
employment_level_tall.head()

     year month_name employment_level  month       date
0    1948        Jan            56339      1 1948-01-01
74   1948        Feb            56440      2 1948-02-01
148  1948        Mar            56601      3 1948-03-01
222  1948        Apr            57471      4 1948-04-01
296  1948        May            57763      5 1948-05-01

### Read-in and format Unemployment Rate

In [27]:
unemployment_rate=pd.read_csv('../data/bls/unemployment_rate_LNU04000000.csv')

In [28]:
unemployment_rate.head()

   Year  Jan  Feb  Mar  Apr  May  Jun  Jul  Aug  Sep  Oct  Nov  Dec
0  1948  4.0  4.7  4.5    4  3.4  3.9  3.9  3.6  3.4  2.9  3.3  3.6
1  1949  5.0  5.8  5.6  5.4  5.7  6.4    7  6.3  5.9  6.1  5.7    6
2  1950  7.6  7.9  7.1    6  5.3  5.6  5.3  4.1    4  3.3  3.8  3.9
3  1951  4.4  4.2  3.8  3.2  2.9  3.4  3.3  2.9    3  2.8  3.2  2.9
4  1952  3.7  3.8  3.3    3  2.9  3.2  3.3  3.1  2.7  2.4  2.5  2.5

In [29]:
unemployment_rate.columns

Index(['Year', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep',
       'Oct', 'Nov', 'Dec'],
      dtype='object')

In [30]:
unemployment_rate.isnull().sum()

Year    0
Jan     0
Feb     0
Mar     0
Apr     0
May     0
Jun     0
Jul     0
Aug     0
Sep     0
Oct     0
Nov     0
Dec     0
dtype: int64

In [31]:
unemployment_rate_tall = unemployment_rate.melt(id_vars = ['Year'], value_vars=['Jan', 'Feb', 'Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'], var_name=['month_name'], value_name='unemployment_rate')

In [32]:
unemployment_rate_tall=unemployment_rate_tall.rename(columns={'Year':'year'})

In [33]:
unemployment_rate_tall.head()

   year month_name unemployment_rate
0  1948        Jan                 4
1  1949        Jan                 5
2  1950        Jan               7.6
3  1951        Jan               4.4
4  1952        Jan               3.7

In [34]:
def month_number(counter):
    if (counter['month_name'] == 'Jan'):
        return 1
    elif (counter['month_name'] == 'Feb'):
        return 2
    elif (counter['month_name'] == 'Mar'):
        return 3
    elif (counter['month_name'] == 'Apr'):
        return 4
    elif (counter['month_name'] == 'May'):
        return 5
    elif (counter['month_name'] == 'Jun'):
        return 6
    elif (counter['month_name'] == 'Jul'):
        return 7
    elif (counter['month_name'] == 'Aug'):
        return 8
    elif (counter['month_name'] == 'Sep'):
        return 9
    elif (counter['month_name'] == 'Oct'):
        return 10
    elif (counter['month_name'] == 'Nov'):
        return 11
    elif (counter['month_name'] == 'Dec'):
        return 12
    else:
        return 'adjust'
unemployment_rate_tall["month"] = unemployment_rate_tall.apply(month_number, axis=1)

In [35]:
unemployment_rate_tall.head()

   year month_name unemployment_rate  month
0  1948        Jan                 4      1
1  1949        Jan                 5      1
2  1950        Jan               7.6      1
3  1951        Jan               4.4      1
4  1952        Jan               3.7      1

In [36]:
unemployment_rate_tall['date'] = pd.to_datetime(unemployment_rate_tall[['year', 'month']].assign(day=1))

In [37]:
unemployment_rate_tall = unemployment_rate_tall.sort_values('date')

In [38]:
unemployment_rate_tall.head()

     year month_name unemployment_rate  month       date
0    1948        Jan                 4      1 1948-01-01
74   1948        Feb               4.7      2 1948-02-01
148  1948        Mar               4.5      3 1948-03-01
222  1948        Apr                 4      4 1948-04-01
296  1948        May               3.4      5 1948-05-01

#### Merging data

In [39]:
data_combined2 = pd.merge(civilian_pop_tall,employment_level_tall[['date','employment_level']],on='date', how='left')

In [40]:
data_combined3 = pd.merge(data_combined2,unemployment_rate_tall[['date','unemployment_rate']],on='date', how='left')

In [41]:
data_combined3.head()

,year,month_name,month,date,civilian_pop,employment_level,unemployment_rate
0,1948,Jan,1,1948-01-01,102603,56339,4
1,1948,Feb,2,1948-02-01,102698,56440,4.7
2,1948,Mar,3,1948-03-01,102771,56601,4.5
3,1948,Apr,4,1948-04-01,102831,57471,4
4,1948,May,5,1948-05-01,102923,57763,3.4